package com.tamilcalender;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.widget.TextView;

import com.google.android.gms.ads.AdRequest;
import com.google.android.gms.ads.AdView;
import com.google.android.gms.ads.MobileAds;

public class rrrrasi extends AppCompatActivity {
    private TextView rasi,description;

    private AdView adView;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_rrrrasi);

        //todo:banner ads
        // Initialize the Mobile Ads SDK
        MobileAds.initialize(this, initializationStatus -> {});
        // Find the AdView as defined in the XML
        adView = findViewById(R.id.adView7);
        // Create an ad request
        AdRequest adRequest = new AdRequest.Builder().build();
        // Load the ad into the AdView
        adView.loadAd(adRequest);


        rasi = (TextView) findViewById(R.id.textView588);
        description = (TextView) findViewById(R.id.textView589);

        rasi.setText("திருக்குறள்");
        description.setText("திருக்குறள், சுருக்கமாகக் குறள் (ஆங்கிலம்: Tirukkuṟaḷ), ஒரு தொன்மையான தமிழ் மொழி அற" +
                " இலக்கியமாகும். சங்க இலக்கிய வகைப்பாட்டில் பதினெண்கீழ்க்கணக்கு எனப்படும் பதினெட்டு நூல்களின் திரட்டில்" +
                " இருக்கும் இந்நூல் குறள் வெண்பா என்னும் பாவகையினாலான 1,330 ஈரடிச் செய்யுள்களைக் கொண்டது.[1] இந்நூல் முறையே " +
                "அறம், பொருள், காமம் (அல்லது இன்பம்) ஆகிய மூன்று பகுப்புகளை அல்லது தொகுப்புகளைக் கொண்டது.[2][3][4] இஃது " +
                "அடிப்படையில் ஒரு வாழ்வியல் நூல். மாந்தர்கள் தம் அகவாழ்விலும் சுமூகமாகக் கூடி வாழவும் புற வாழ்விலும் இன்பமுடனும் " +
                "இசைவுடனும் நலமுடனும் வாழவும் தேவையான அடிப்படைப் பண்புகளை விளக்குகிறது. அறநெறிகளைப் பற்றிய உலகின் " +
                "மிகச்சிறந்த படைப்புகளில் ஒன்றாகக் கருதப்படும் இந்நூல், பொதுத்தன்மைக்கும் மதச்சார்பற்ற தன்மைக்கும் பெயர் பெற்றது.[5][6]" +
                " இதனை இயற்றியவர் திருவள்ளுவர் என்று பாரம்பரியமாக அறியப்படுகிறார். இந்நூலின் காலம் பொ.ஊ.மு. 300 முதல் பொ.ஊ." +
                " 5-ம் நூற்றாண்டு வரை எனப் பலவாறு கணிக்கப்படுகிறது. பாரம்பரியமாக இந்நூல் கடைச்சங்கத்தின் கடைசிப் படைப்பாகக் " +
                "கருதப்பட்டாலும் மொழியியல் பகுப்பாய்வுகள் இந்நூல் பொ.ஊ. 450 முதல் 500 வரையிலான கடைச்சங்க காலத்திற்குப் பிறகு " +
                "இயற்றப்பட்டதாகக் குறிக்கின்றன.[7]  இந்திய அறிவாய்வியல், மீவியற்பியல் ஆகியவற்றின் மிகப் பழமையான படைப்புகளில் " +
                "ஒன்றாகக் கருதப்படும் திருக்குறள், &quot;உலகப் பொதுமறை&quot;, &quot;பொய்யாமொழி&quot;, &quot;வாயுறை வாழ்த்து&quot;," +
                " &quot;முப்பால்&quot;, &quot;உத்தரவேதம்&quot;, &quot;தெய்வநூல்&quot; எனப் பல பெயர்களாலும் அழைக்கப்படுகிறது.[8][9]" +
                " அகிம்சையை மையமாகக் கொண்டு இயற்றப்பட்ட இந்நூல்,[10][11][12][13][14] தனிநபர் அடிப்படை நல்லொழுக்கங்களாக " +
                "இன்னா செய்யாமை மற்றும் புலால் உண்ணாமை ஆகியவற்றை வலியுறுத்துகிறது.[15][16][17][18][19][a] இவற்றொடு வாய்மை," +
                " கருணை, அன்பு, பொறுமை, சுயகட்டுப்பாடு, நன்றியுணர்வு, கடமை, சான்றாண்மை, ஈகை, விருந்தோம்பல், இல்வாழ்க்கை " +
                "நலம், பரத்தையரோடு கூடாமை, கள்ளாமை, மது உள்ளிட்ட போதைப்பொருட்களையும் சூதாடுவதையும் தவிர்த்தல், " +
                "கூடாஒழுக்கங்களை விலக்குதல் முதலிய அனைத்துத் தனிநபர் ஒழுக்கங்களையும் போதித்துக்[20] கூடுதலாக ஆட்சியாளர் மற்றும் " +
                "அமைச்சர்களின் ஒழுக்கங்கள், சமூகநீதி, அரண், போர், கொடியோருக்குத் தண்டனை, கல்வி, உழவு போன்ற பலவிதமான " +
                "அரசியல் மற்றும் சமூகத் தலைப்புகளை உள்ளடக்கியது.[21][22][23] மேலும் நட்பு, காதல், தாம்பத்தியம் மற்றும் அகவாழ்க்கை " +
                "பற்றிய அதிகாரங்களும் இதில் அடங்கும்.[20][24] சங்ககாலத் தமிழரிடையே காணப்பட்ட குற்றங்களையும் குறைகளையும் " +
                "மறுத்துரைத்து அவர்தம் பண்பாட்டு முரண்களைத் திருத்தியும் பிழைப்பட்ட வாழ்வியலை மாற்றியும் தமிழ்க் கலாச்சாரத்தினை " +
                "நிரந்தரமாக வரையறை செய்த நூலாகத் திருக்குறள் திகழ்கிறது.[25]  இயற்றப்பட்ட காலத்திலிருந்து குறள் அற, சமூக, அரசியல்," +
                " பொருளாதார, மத, தத்துவ மற்றும் ஆன்மீகத் துறைகளைச் சார்ந்த அறிஞர்களாலும் தலைவர்களாலும் பரவலாகப் போற்றப்பட்டு" +
                " வந்துள்ளது.[26] இவர்களில் இளங்கோவடிகள், கம்பர், லியோ டால்ஸ்டாய், மகாத்மா காந்தி, ஆல்பர்ட் சுவைட்சர், இராமலிங்க " +
                "அடிகள், வ. உ. சிதம்பரம்பிள்ளை, காரல் கிரவுல், ஜி. யு. போப், அலெக்சாந்தர் பியாதிகோர்சுகி மற்றும் யூ ஹ்சி ஆகியோர் " +
                "குறிப்பிடத்தக்கவர்கள் ஆவர். தமிழ் இலக்கியங்களில் மிகவும் அதிகமாக மொழிபெயர்க்கப்பட்ட நூலாகவும் அதிகம் சுட்டப்பட்ட " +
                "நூலாகவும் அதிகம் சுட்டப்படக்கூடிய நூலாகவும் திருக்குறள் திகழ்கிறது.[27] நாற்பதுக்கும் மேற்பட்ட இந்திய மற்றும் அயல் நாட்டு " +
                "மொழிகளில் மொழிபெயர்க்கப்பட்டுள்ள இந்நூல் உலகின் அதிகமாக மொழிபெயர்க்கப்பட்ட பண்டைய படைப்புகளில் ஒன்றாகும்." +
                " 1812-ம் ஆண்டு முதன்முறையாக அச்சுக்கு வந்ததிலிருந்து இடையறாது அச்சில் உள்ள நூலாகக் குறள் திகழ்கிறது.[28] திருக்குறள்" );

    }}