package com.tamilcalender;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.Button;
import android.widget.TextView;

public class varuda_rasi_palan extends AppCompatActivity {
    private Button measam,resabam,mithunam,kadagam,simmam,kanni,thulam,
            viruchigam,thanusu,magaram,kumbam,meenam;

    private TextView rasi,description;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_varuda_rasi_palan);

        measam = (Button) findViewById(R.id.button13);
        resabam = (Button) findViewById(R.id.button15);
        mithunam = (Button) findViewById(R.id.button17);
        kadagam = (Button) findViewById(R.id.button19);
        simmam = (Button) findViewById(R.id.button21);
        kanni = (Button) findViewById(R.id.button23);
        thulam = (Button) findViewById(R.id.button14);
        viruchigam = (Button) findViewById(R.id.button16);
        thanusu= (Button) findViewById(R.id.button18);
        magaram = (Button) findViewById(R.id.button20);
        kumbam = (Button) findViewById(R.id.button22);
        meenam = (Button) findViewById(R.id.button12);

        rasi = (TextView) findViewById(R.id.textView591);
        description= (TextView) findViewById(R.id.textView592);

        measam.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                activity1();
            }
        });

        resabam .setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                activity2();
            }
        });
        mithunam.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                activity3();
            }
        });

        kadagam .setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                activity4();
            }
        });
        simmam.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                activity5();
            }
        });

        kanni .setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                activity6();
            }
        });
        thulam.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                activity7();
            }
        });

        viruchigam .setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                activity8();
            }
        });
        thanusu.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                activity9();
            }
        });

        magaram.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                activity10();
            }
        });
        kumbam.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                activity11();
            }
        });

        meenam.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                activity12();
            }
        });




    }


    private void activity1() {
        rasi.setText("மேஷம் ");
        description.setText("இனிய ஆங்கில புத்தாண்டு 2024-ல் அடி எடுத்து வைக்கும் மேஷ ராசி அன்பர்களே, இவ்வாண்டு உங்களுக்கு நடைபெறவிருக்கும் பலன்களை பார்ப்போம். இந்த 2024 புத்தாண்டு சென்ற ஆண்டைவிட சிறப்பாக இருக்கும் என்பதில் சந்தேகமம் வேண்டாம். 2024ல் முக்கிய கிரகமான சனி பகவான் உங்களுக்கு சாதமாக நிலையில் உள்ளார். அவர் நிச்சயம் பல நன்மைகளை செய்வர். இவ்வாண்டு இன்ப - துன்பம் கலந்த பலன்களை பெற முடியும். உங்கள் லாப ஸ்தானத்தின் 11வது வீட்டில் சனி பெயர்ச்சியுடன் இந்தப் புத்தாண்டு இனிதே தொடங்குகிறது. மேலும் 6ம் வீட்டில் கேதுவும் நல்ல பலன்களைத் தருவார். இருப்பினும் உங்கள் ஜென்ம ஸ்தானத்தில் குரு சஞ்சாரம் தான் உங்களுக்கு பலவீனமாக உள்ளது. ஏப்ரல் 30, 2024 வரை இந்த ஆண்டின் முதல் 4 மாதங்களுக்கு உங்கள் 1ஆம் வீட்டில் குருவும் 12 ஆம் வீட்டில் ராகுவும் கசப்பான அனுபவங்களை உருவாக்கும். மே 01, 2024 அன்று குரு உங்கள் 2வது வீட்டிற்குச் சென்றவுடன், இந்த ஆண்டு முழுவதும் நீங்கள் நல்ல அதிர்ஷ்டத்தை அனுபவிக்க முடியும். இந்த வருடம் ஏற்றமும், மாற்றமும் உங்களைத் தேடிவரும். அக்டோபர் 09, 2024 முதல் நவம்பர் 15, 2024 வரை சுமார் ஆறு வாரங்களுக்கு நீங்கள் மந்தநிலையை அனுபவிக்க வேண்டிவரும். ஒட்டுமொத்தமாக, ஏப்ரல் 30, 2024 வரை சோதனைக் கட்டத்தைக் கடக்க உங்கள் ஆன்மீக பலத்தை அதிகரிக்க வேண்டும். மே 01, 2024 முதல் நீங்கள் ஒரு பொற்காலத்தை அனுபவிக்க முடியும். அனைத்து முக்கிய கிரகங்களான ராகு, கேது, சனி மற்றும் குரு ஆகியவை கொடுக்க சாதகமான இடத்தில் இருக்கும். நீங்கள் செய்யும் எந்த ஒரு செயலிலும் பெரிய வெற்றியைப் பெற முடியும். உங்கள் நீண்ட கால ஆசைகள் மற்றும் வாழ்நாள் கனவுகள் நனவாகும். பொருளாதாரக் ரீதியாக உங்களுக்கு சாதகமான பலன்களைத் தரும், மேலும் மேஷ ராசிக்காரர்களின் வாழ்க்கையில் நேர்மறையையும் கொண்டு வரும். இது தவிர, வாழ்க்கையின் பல்வேறு துறைகளில் வெற்றியை அடைய முன்பை விட கடினமாக உழைக்க வேண்டியிருக்கும். உங்களுக்கு உடல்நலம் தொடர்பான சில சிறிய பிரச்சனைகள் ஏற்பட வாய்ப்புள்ளது. உங்கள் ஆரோக்கியத்தில் சிறப்பு கவனம் செலுத்துவதன் மூலம், உங்கள் உணவில் கவனம் செலுத்த வேண்டும். கிரகப் பெயர்ச்சியின் தாக்கம் உங்கள் குடும்ப வாழ்க்கையில் காணப்படும். மேஷ ராசிக்காரர்களுக்கு இந்த 2024ம் ஆண்டு லாபங்கள் நிறைந்த ஆண்டாக அமைய போகிறது எல்லாவற்றிற்கும் இறை வழிபாடு ஒன்றே சிறந்த பரிகாரம்.\n" +
                "பரிகாரம் : செவ்வாய்கிழமை தோறும் முருகன் கோவிலுக்குச் சென்று வலம் வரவும்.\n" +
                "\n" +
                "இந்த 2024-ல் மாதம் தோறும் வரும் சந்திராஷ்டம தினத்தில் மட்டும் சிறிது எச்சரிக்கையாக இருக்கவும். ");

    }
    private void activity2() {
        rasi.setText("ரிஷபம் ");
        description.setText("இனிய ஆங்கில புத்தாண்டு 2024-ல் அடி எடுத்து வைக்கும் ரிஷப ராசி அன்பர்களே, இவ்வாண்டு உங்களுக்கு நடைபெறவிருக்கும் பலன்களை பார்ப்போம். இந்த ஆண்டு எந்த சிக்கலுமின்றி இனிமையாக செல்லும். நிதி நிலையை பொறுத்தமட்டில் இந்த வருடம் மிக சிறப்பாக அமையும். அதிக பணம் சம்பாதிக்க முடியும். 2024 உங்களை பொறுத்தமட்டில் செழிப்பான ஆண்டு. இந்தப் புதிய ஆண்டு உங்கள் நிதிநிலைக்கு குறிப்பாக முதல் 3 மாதங்களில் நல்ல பலன்களைத் தரும். ராகு உங்கள் 11வது வீட்டில் உங்கள் பணவரவை அதிகரிக்கும். ஆனால் உங்கள் ஐந்தாம் வீட்டிற்கு கேது சஞ்சாரம் செய்வது குடும்ப பிரச்சனைகளை உருவாக்கும். நீங்கள் தேவையற்ற பயம் மற்றும் பதற்றத்தை உருவாக்கலாம். ஆனால் இந்த புத்தாண்டு 2024 இல் 10 ஆம் வீட்டில் சனியின் அழுத்தத்தை நீங்கள் சமாளிக்க வேண்டியிருக்கும். ஏப்ரல் 30, 2024 வரை வியாழன் உங்கள் 12வது வீட்டில் இருக்கும்போது சில நல்ல பலன்களை அனுபவிப்பீர்கள். சுப காரிய செயல்பாடுகளை நடத்த இது ஒரு நல்ல நேரம். ஆனால் செலவுகள் எகிறும். உங்கள் நிதி பொறுப்புகளை நிர்வகிக்க உங்கள் பொறுப்புகளை அதிகரிக்க வேண்டும். நீங்கள் கடினமாக உழைக்க வேண்டும், ஆனால் குறைந்த பலன்களே கிடைக்கும். உங்கள் பணியிடத்தில் எந்த வளர்ச்சியும் இல்லாமல் இருக்கும். துரதிர்ஷ்டவசமாக, மே 01, 2024க்குப் பிறகான நேரம் சற்று கடினமாக தான் தெரிகிறது. உங்கள் ஜென்ம ஸ்தானத்தில் குரு, 10 ஆம் வீட்டில் சனி மற்றும் உங்கள் 5 ஆம் வீட்டில் கேது என உள்ளது. உங்கள் உடல்நிலை மோசமாக பாதிக்கப்படும். உங்கள் நம்பிக்கையின் அளவு குறையும். சில தோல்விகளையும் ஏமாற்றங்களையும் காண வேண்டிவரும். உங்கள் நிதி பிரச்சனைகளால் பீதி அடையும். ஒட்டுமொத்தமாக, ஏப்ரல் 2024 வரை நல்ல பலன்களைக் காண முடியும். ஆனால் மே 01, 2024 முதல் கடுமையான சோதனைக் கட்டமாக இருக்கும். உங்கள் நிதி பிரச்சனைகளை குறைக்க நீங்கள் குல தெய்வத்தை முறையாக சென்று வழிபடவும். இந்த சோதனைக் கட்டத்தை கடக்க உங்கள் ஆன்மீக பலத்தை அதிகரிக்க லலிதா சஹஸ்ர நாமம் கேட்கவும். இந்த ஆண்டு உங்களுக்கு பெரிய மாற்றங்களைக் கொண்டு வரப் போகிறது. இந்த ஆண்டு நீங்கள் கடினமாக உழைக்க வேண்டும். 2024 இன் படி, நீங்கள் உங்கள் செல்வத்தை அதிகரிக்க வேண்டும் மற்றும் ஆடம்பரத்திற்காக ஏதாவது செலவிட வேண்டும். இந்த வருடம் நீங்கள் மிகவும் சுறுசுறுப்பாக இருக்கப் போகிறீர்கள். இருப்பினும், ஆண்டின் இரண்டாம் பாதி உங்களுக்கு சில நோய்களைக் கொண்டு வரலாம். தொழில் ரீதியாக, உங்கள் தொழில் ரீதியாக இந்த நேரம் உங்களுக்கு மிகவும் சிறப்பாக இருக்கும். இருப்பினும், ஒரு கூட்டு தொழில் உங்களுக்கு சரியாக இருக்காது. நீங்கள் வெளிநாட்டில் குடியேற விரும்பினால், இந்த நேரம் உங்களுக்கு சரியானதாக இருக்கும். இந்த ஆண்டு பொருளாதார வளர்ச்சி அதி அற்புதமாக இருக்கும். எல்லாவற்றிற்கும் இறை வழிபாடு ஒன்றே சிறந்த பரிகாரம்.\n" +
                "பரிகாரம் : குல தெய்வ வழிபாடு அதிகளவில் நன்மை தரும்.\n" +
                "முக்கிய குறிப்பு : இந்த 2024-ல் மாதம் தோறும் வரும் சந்திராஷ்டம தினத்தில் மட்டும் சிறிது எச்சரிக்கையாக இருக்கவும்.");

    }
    private void activity3() {
        rasi.setText("மிதுனம் ");
        description.setText("இனிய ஆங்கில புத்தாண்டு 2024-ல் அடி எடுத்து வைக்கும் மிதுன ராசி அன்பர்களே, இவ்வாண்டு உங்களுக்கு நடைபெறவிருக்கும் பலன்களை பார்ப்போம். இதுவரை பல தடைகளையும், தாமதங்களையும் தந்த அஷ்டமத்துச் சனி முடிந்ததால் இந்த 2024 ஆண்டு நல்ல விதமாக அமையும். பொதுவான விஷயங்கள் தவிர வேறு எந்த பிரச்சினையும் இல்லாமல் இந்த ஆண்டு இனிமையாகவே அமையும். பணப்புழக்கம் நன்றாக இருக்கும். 2024-ல் குடும்பத்தில் மகிழ்ச்சி அதிகரிக்கும். வருடத்தின் பெரும்பான்மையான பகுதி உங்களுக்கு சாதகமானது. இந்த புத்தாண்டு 2024 ஏப்ரல் 30, 2024 வரை உங்கள் லாப ஸ்தானத்தின் 11 வது வீட்டில் குருவுடன் தொடங்குகிறது. உங்கள் பாக்கிய ஸ்தானமான 9 ஆம் வீட்டில் சனி உங்கள் வளர்ச்சிக்கு நல்ல ஆதரவை வழங்கும். உங்களின் 10ம் வீட்டில் ராகுவும், 4ம் வீட்டில் கேதுவும் சஞ்சரிப்பது நல்ல பலனைத் தராது. ஜனவரி 01, 2024 முதல் ஏப். 30, 2024 வரையிலான முதல் 4 மாதங்களுக்கு உங்கள் வாழ்க்கையில் மகிழ்ச்சி இருக்கும். உங்கள் நிதிப் பிரச்சனைகளில் இருந்து வெளிவர முடியும். பணியிடத்தில் நல்ல முன்னேற்றம் உண்டு. சுப காரிய செயல்களை நடத்த இது ஒரு சிறந்த நேரம். புது வீட்டிற்குச் செல்வதில் வெற்றி கிட்டும். ஆனால் மே 01, 2024 முதல் டிசம்பர் 31, 2024 வரை உங்களுக்கு அதிர்ஷ்டம் அவ்வளவாக இருக்காது. உங்கள் 12வது வீட்டில் இருக்கும் குரு சுப காரியச் செலவுகளை உருவாக்குகிறார். ஆனால் உங்கள் நான்காம் வீட்டில் கேது தேவையற்ற செலவுகளை உருவாக்குவார். மே 2024 க்குப் பிறகு உங்கள் 10 ஆம் வீட்டில் ராகு இருப்பதால் உங்கள் உத்யோக வகையில் மோசமாக பாதிக்கப்படும். மொத்தத்தில், ஜனவரி 01, 2024 முதல் ஏப்ரல் 30, 2024 வரையிலான முதல் 4 மாதங்களில் அதிக அதிர்ஷ்டத்தைப் பெற முடியும். பிறகு கலவையான பலன்களே கிடைக்கும். நீங்கள் மனதார நினைத்து வழிபட நிதி நிலையில் அதிர்ஷ்டம் பெருகும். ஜோதிட ரீதியாக பார்க்கும் போது 2024 ஆம் ஆண்டின் முடிவு மிதுன ராசிக்காரர்களுக்கு மிகவும் நன்மையாக இருக்கும். அதுவரை உங்கள் வாழ்க்கை ஏற்ற தாழ்வுகள் நிறைந்ததாக இருக்கும். ஜாதகம் 2024 உங்களுக்கு பல புதிய வாய்ப்புகளை கொண்டு வரும். ஆண்டின் 2024 இந்த ஆண்டு உங்கள் நிதி நிலை உயரக்கூடும் என்று கூறுகிறது. இந்த ஆண்டு உங்கள் பழைய கடன்கள் அனைத்தையும் வெற்றிகரமாக திருப்பிச் செலுத்தலாம். இந்த ஆண்டு உடல் ஆரோக்கியத்திலும் சிறப்பாக இருக்கும் என எதிர்பார்க்கப்படுகிறது. புதிய தொழில் வாய்ப்புகளும் தெரியும். இருப்பினும், வேலையின் அழுத்தம் அதிகரித்து வருவதாகத் தெரிகிறது. மனதுக்குள் மத நம்பிக்கை அதிகரிக்கும். ஆன்மீக பயணம் உங்களுக்கு மிகவும் பயனுள்ளதாக இருக்கும். நவ கிரகங்களும் சாதகமான நிலையில் பயணம் செய்வதால் தடைகள் எல்லாம் தகர்ந்து விடும். எல்லாவற்றிற்கும் இறை வழிபாடு ஒன்றே சிறந்த பரிகாரம்.\n" +
                "பரிகாரம் : பெருமாள் கோவிலுக்குச் சென்று வலம் வரவும்.\n" +
                "முக்கிய குறிப்பு : இந்த 2024-ல் மாதம் தோறும் வரும் சந்திராஷ்டம தினத்தில் மட்டும் சிறிது எச்சரிக்கையாக இருக்கவும்.");

    }
    private void activity4() {
        rasi.setText("கடகம் ");
        description.setText("இனிய ஆங்கில புத்தாண்டு 2024-ல் அடி எடுத்து வைக்கும் கடக ராசி அன்பர்களே, இவ்வாண்டு உங்களுக்கு நடைபெறவிருக்கும் பலன்களை பார்ப்போம். இந்த 2024ஆண்டு ஆரம்பம் முதற்கொண்டே உங்களுக்கு அஷ்டம சனியின் தாக்கம் இருக்கும். இந்த ஆண்டு அஷ்டமத்துச்சனி அலைச்சலையும், அதிக விரயத்தையும் ஏற்படுத்தும். கட்டுக்கடங்காத செலவுகளைக் கொடுத்து உங்களை திணற வைக்கும். உங்களுக்கு அலைச்சலை ஏற்படுத்தினாலும் ஆதாயத்தைக் கொடுக்கும். இந்த ஆண்டு அஷ்டம சனி மற்றும் குருவின் சாதகமற்ற நிலையுடன் தொடங்குகிறது. நீங்கள் மன அழுத்த சூழ்நிலையில் இருக்கலாம். உங்கள் 3ம் வீட்டில் இருக்கும் கேது நல்ல அதிர்ஷ்டத்தை தரக்கூடியது என்பது நல்ல செய்தி. ராகு உங்கள் 9 ஆம் வீட்டில் விஷயங்களை சிக்கலாக்கும். ஏப்ரல் 30, 2024 வரை சோதனைக் கால கட்டம் தான். பதற்றம், வேலை அழுத்தம் மற்றும் ஏமாற்றங்களை அனுபவிக்கா வேண்டிவரும். ஆரோக்கியத்திற்கு அதிக முக்கியத்துவம் கொடுக்க வேண்டும். பிரியமானவர்களுடன் உங்கள் உறவு பாதிக்கப்படும். உங்கள் பணியிடத்தில் விஷயங்கள் சரியாக நடக்காமல் போகலாம். உங்கள் நிதி நிலைமை பாதிக்கப்படும். தொழில், வியாபாரத்தில் நிதிப் பிரச்சனைகளால் மிகுந்த மன அழுத்தத்திற்கு ஆளாக நேரிடும். நீங்கள் பல பிரச்சனைகளை கடந்து செல்லும் போது, நீங்கள் நல்ல ஆன்மீக அறிவைப் பெற முடியும். மே 01, 2024 முதல் குரு உங்களின் 11வது வீடான லாப ஸ்தானத்தில் நுழைவதால் சிறப்பாக செயல்பட முடியும். உங்கள் நிதி நிலை சிறப்பாக இருக்கும். உங்கள் பணியிடத்தில் மகிழ்ச்சியாக இருக்க முடியும். புதிய வீடு வாங்குவதற்கும், வீடு மாறுவதற்கும் நல்ல நேரம். தவிர்க்க முடியாத சனி பகவானால் குறிப்பிடத்தக்க மன அழுத்தம் மற்றும் பதற்றம் ஏற்படும். ஒட்டுமொத்தமாக, ஏப்ரல் 30, 2024 வரையிலான முதல் 4 மாதங்களில் நீங்கள் மிகவும் கவனமாக இருக்க வேண்டும் என்று அறிவுறுத்த படுகிறது. மே 01, 2024 முதல் நீங்கள் மிகவும் சிறப்பாக செயல்பட முடியும். சோதனைக் கட்டத்தைக் கடந்து செல்வது முக்கியம். உங்கள் அதிர்ஷ்டத்தை அதிகரிக்க பகவானை பிரார்த்தனை செய்யவும். இந்த ஆண்டு உங்களின் பொருளாதார மற்றும் சமூக அந்தஸ்து அதிகரிக்கும். நிச்சயமாக, உங்களுக்கு புதிய வாய்ப்புகள் கிடைக்கும், ஆனால் அதே நேரத்தில், உங்கள் பொறுப்புகளும் அதிகரிக்கும். இதன் காரணமாக, உங்கள் வாழ்க்கையில் பதற்றம் அதிகரிக்கும் வாய்ப்பும் உள்ளது. இது உங்கள் ஒட்டுமொத்த ஆரோக்கியத்தையும் பாதிக்கும். 2024 ஆண்டு உங்கள் செலவுகளைக் கட்டுப்படுத்த வேண்டும். இந்த ஆண்டு சூதாட்டம் போன்றவற்றில் இருந்து விலகி இருக்க வேண்டும். எதையும் ஒரு முறைக்கு பல முறை யோசித்து பேசவும் ஆண்டின் பிற்பகுதியில், உங்களுக்கு உடல்நலம் தொடர்பான சில பிரச்சனைகள் இருக்கலாம். இருப்பினும், உங்கள் சமூக அந்தஸ்து அதிகரிக்கும் வாய்ப்பும் உள்ளது. தெய்வ வழிபாட்டில் கவனம் செலுத்தினால் வரும் துயரங்கள் ஓரளவாவது குறையும். 2024ஆம் ஆண்டில் சவால்களை அதிகளவில் சமாளிக்க வேண்டியிருக்கும். எல்லாவற்றிற்கும் இறை வழிபாடு ஒன்றே சிறந்த பரிகாரம்.\n" +
                "பரிகாரம் : நரசிம்மரை சனிக்கிழமையில் சென்று வழிபடுவது நன்மை தரும்…\n" +
                "\n" +
                "முக்கிய குறிப்பு : இந்த 2024-ல் மாதம் தோறும் வரும் சந்திராஷ்டம தினத்தில் மட்டும் சிறிது எச்சரிக்கையாக இருக்கவும்.");

    }
    private void activity5() {
        rasi.setText("சிம்மம்");
        description.setText("இனிய ஆங்கில புத்தாண்டு 2024-ல் அடி எடுத்து வைக்கும் சிம்ம ராசி அன்பர்களே, இவ்வாண்டு உங்களுக்கு நடைபெறவிருக்கும் பலன்களை பார்ப்போம். 2024ஆம் வருடம் லாபகரமானது. உங்கள் வாழ்க்கை அனைத்து வகையிலும் சிறப்பாக அமையும். மே மாதத்திற்கு முன்பு நல்ல காலம் இருக்கும். உங்கள் துணையுடனும் மற்றவர்களுடனும் இணக்கமான சூழல் உருவாகும். உங்கள் பொருளாதார நிலையை பொறுத்தமட்டில் செல்வம் பெருகும். சென்ற வருடம் உடல் ஆரோக்கியம் மற்ற எல்லா விஷயத்திலும் சரி நீங்கள் பட்ட கஷ்டம் கொஞ்சம் நஞ்சம் அல்ல, அனால் இந்த ஆண்டு நிச்சயம் அப்படி இருக்காது. உங்களுக்கு பெரியளவில் நல்லது நடக்காவிட்டாலும் கெடுதல் நிச்சயம் நடக்காது. ஆண்டின் ஆரம்ப மாதங்களில், குரு 9ஆம் வீட்டில் இருக்கும். இந்த நேரத்தில் அதிர்ஷ்டம் உங்களுடன் இருக்கும். பணம் சம்பந்தமான பிரச்சனைகளும் நீங்கும். இந்த நான்கு மாதங்களில் ஆன்மீக பயணங்கள் மேற்கொள்ள முடியும். மே மாதத்திற்குப் பிறகு, குரு 10ம் வீட்டிற்குள் நுழைவார். இந்த நேரத்தில், தொழில் சம்பந்தமாக எந்த சிறப்பு பிரச்சனையும் இருக்காது, ஆனால் புதிய மாற்றங்கள் பற்றி விரைவான முடிவுகளை எடுப்பதை தவிர்க்கவும். இந்த வருடம் முழுவதும் ராகுவிடம் கவனமாக இருக்க வேண்டும். ராகு உங்கள் 8வது வீட்டில் சஞ்சரிப்பதால், சிறு சிறு விபத்துகள் அல்லது குடும்பத்தாருடன் சண்டை சச்சரவுகள் அடிக்கடி நிகழும். பெரும்பாலும் நீங்கள் குடும்பத்தை விட்டு வெளியேறுவது போல் உணர்வு ஏற்படும். ஆனால் இவை அனைத்திற்கும் மத்தியில், நல்ல விஷயம் என்னவென்றால், நீங்கள் சில திடீர் பண ஆதாயத்தையும் பெறலாம். இந்த ஆண்டின் நடுப்பகுதியில் நீங்கள் மிகவும் நல்ல நிலையில் இருக்க முடியும். இருப்பினும், வியாபாரத்தில் கவனமாக இருக்க வேண்டிய நேரம் இது. இந்த ஆண்டு முழுவதும் சனி உங்கள் 7ம் வீட்டில் இருப்பதால் பெரிய முடிவுகளை உடனடியாக எடுக்க வேண்டாம். நீங்கள் வியாபாரத்தில் புதிதாக ஏதாவது செய்ய விரும்பினால், ஏப்ரல் மாதத்திற்குப் பிறகு முயற்சிக்கவும். மனதில் நல்ல பல சிந்தனைகள் தோன்றி தர்ம காரியங்கள் செய்ய வைக்கும். ஆன்மீக ஆர்வம் கூடும். புதிய சொத்துக்கள் வாங்குவது, விற்பதில் நல்ல லாபம் கிடைக்கும். கடன் கட்டுக்குள் இருக்கும். வண்டி, வாகனங்களில் செல்லும் போது கவனம் தேவை. வழக்கில் சாதகமாக தீர்ப்பு வரும். பொருளாதார வளர்ச்சி சிறப்பாக இருக்கும். உங்கள் வசதி வாய்ப்புகள் பெருகும், பழைய வீட்டில் இருந்து புது வீட்டிற்கு மாற வாய்ப்புண்டு. உடல் ஆரோக்கியத்தில் நல்ல முன்னேற்றம் ஏற்படும். சமூகத்தில் உங்கள் புகழ் அந்தஸ்து உயரும். எதிரிகள் கண்காணாமல் போவர். குடும்பத்தில் கணவன் மனைவி அன்யோன்யம் அதிகரிக்கும். திருமண வயதில் உள்ளவர்களுக்கு வரன்கள் கூடிவரும். குழந்தை பாக்கியம் கிட்டும். குல தெய்வ வழிபாட்டினை தவறாமல் மேற்கொள்ள முடியும். ஆன்மீக பெரியோர்களின் அன்பும், ஆசியும் கிட்டும். நீங்கள் எடுத்துக்கொண்ட முயற்சிக்கும் உழைப்பிற்கும் நல்ல பலன் கிடைக்கும். நீங்கள் கையில் எடுத்த காரியங்கள் இனிதே நடைபெறும். தொட்டது துலங்கும். வீட்டிற்கு தேவையான பொருட்களை வாங்க முடியும். உத்யோகத்தில் பெயர், புகழ் கிடக்கும். உத்யோகத்தில் உங்கள் உழைப்புக்கு ஏற்ற சன்மானம் கிடைக்கும். தொழில் வியாபாரத்தில் புது முதலீடுகளை கவனமாக செய்யவும். இந்த ஆண்டின் தொடக்கத்தில் நல்ல காலம் இருந்தாலும் நீங்கள் பொறுமையாக இருக்க வேண்டும். சிம்ம ராசிக்காரர்களுக்கு 2024ஆம் ஆண்டு அதி அற்புதமான ஆண்டாக அமையப்போகிறது. எல்லாவற்றிற்கும் இறை வழிபாடு ஒன்றே சிறந்த பரிகாரம்.\n" +
                "பரிகாரம் : கால பைரவர் வழிபாடு நன்மை தரும்.\n" +
                "\n" +
                "முக்கிய குறிப்பு : இந்த 2024-ல் மாதம் தோறும் வரும் சந்திராஷ்டம தினத்தில் மட்டும் சிறிது எச்சரிக்கையாக இருக்கவும்.");

    }
    private void activity6() {
        rasi.setText("கன்னி ");
        description.setText("இனிய ஆங்கில புத்தாண்டில் 2024-ல் அடி எடுத்து வைக்கும் கன்னி ராசி அன்பர்களே, இவ்வாண்டு உங்களுக்கு நடைபெறவிருக்கும் பலன்களை பார்ப்போம். இந்த புத்தாண்டில் சென்ற ஆண்டில் இருந்த பணப்பிரச்னைகள் குறைந்து பொருளாதார நிலை மேம்படும். ருண ரோக சத்ரு ஸ்தானமான 6 ஆம் வீட்டில் இருக்கும் சனியின் பலத்துடன் நல்ல பலனைத் தரும். ஆனால் ராகு உங்கள் 7ம் இடமான களத்திர ஸ்தானத்தில் சஞ்சரிப்பது உங்கள் துணையுடன் பிரச்சனைகளை உருவாக்கும். உங்கள் ஜென்ம ராசிக்கு கேது சஞ்சரிப்பதால் உடல்நலம் பாதிக்கப்படும். 2024 தொடக்கத்தில் குரு உங்கள் அஷ்டமத்தின் 8ஆம் வீட்டில் சஞ்சரிக்கிறார். எனவே, ஜனவரி 01, 2024 மற்றும் ஏப். 30, 2024 க்கு இடையில் நீங்கள் கடுமையான சோதனைக் கட்டமாக இருக்கும். உங்கள் ஆரோக்கியமும் உறவுகளும் மோசமாகப் பாதிக்கப்படும். பணி இடத்தில் உங்களுக்கு எதிராக சில சதி வேலைகள் நடக்கும். நீங்கள் நிதி பிரச்சனைகளால் பாதிக்க கூடும். நீங்கள் மே 01, 2024ஐ அடைந்ததும், உங்கள் வாழ்வில் சுமூகமான பயணம் இருக்கும். நீங்கள் செய்யும் எந்த ஒரு செயலிலும் பெரிய வெற்றியை எதிர்பார்க்கலாம். உங்கள் வளர்ச்சியில் நீங்கள் தடையின்றி இருக்க முடியும். மறைமுக எதிரிகள் தங்கள் பலத்தை இழக்க நேரிடும். தொழில் மற்றும் நிதி வளர்ச்சி சிறப்பாக இருக்கும். சமூகத்தில் ஒரு சக்திவாய்ந்த நிலையை அடைய முடியும். உங்கள் வாழ்க்கையில் நிலைபெற இந்த நேரத்தை பயன்படுத்துவதை உறுதிப்படுத்திக் கொள்ளுவும். ஏப்ரல் 30, 2024 வரை நீங்கள் கவனமாக இருக்க வேண்டும், பின்னர் உங்கள் வாழ்க்கையில் நல்ல அதிர்ஷ்டத்தை அனுபவிக்க முடியும். எதிரிகளிடமிருந்து பாதுகாப்பு பெற நரசிம்ம கவசம் படிக்கவும். பணியிடத்தில் உங்கள் நற்பெயர் உயரும். உங்கள் முன்னேற்றத்திற்கான அனைத்து வாய்ப்புகளும் உள்ளன. ஆனால், இது உங்களுக்கு வேலை அழுத்தத்தை அதிகரிக்கும். புதிய வாய்ப்புகளை உருவாக்கிக்கொள்ள முடியும். இந்த ஆண்டு நீங்கள் நிறைய சவால்களை சந்திக்க வேண்டியிருக்கும். வரும் சவால்களை சிறந்த முறையில் எதிர்கொள்ள முடியும். 2024 சில விரும்பத்தகாத செலவுகள் உங்களை நிதி ரீதியாக தொந்தரவு செய்யலாம் என்பதைக் குறிக்கிறது. நோய் எதிர்ப்பு சக்தி மிகவும் பலவீனமாக இருக்கும் என்று கூறுகிறது. அதனால்தான் கவனமாக இருக்க வேண்டும். புதிய முதலீட்டுத் திட்டங்களைத் மேற்கொள்வதற்கு நேரம் மிகவும் நல்லது, ஆனால் அதில் சில ஆபத்துகள் உள்ளன. தொழில் வகையில் முன்னேற்றம் இருக்கும். வேலை சம்பந்தமாக இந்த ஆண்டு நிறைய பயணம் செய்ய வேண்டியிருக்கும். 2024ஆம் ஆண்டு பொருளாதார வளம் நிறைந்த ஆண்டாக கன்னி ராசிக்காரர்களுக்கு அமையப்போகிறது. எல்லாவற்றிற்கும் இறை வழிபாடு ஒன்றே சிறந்த பரிகாரம்.\n" +
                "பரிகாரம் : ஸ்ரீரங்கம் ஸ்ரீரங்கநாதரை வெள்ளிக்கிழமை சென்று வழிபடுவது நன்மை தரும்….\n" +
                "முக்கிய குறிப்பு : இந்த 2024-ல் மாதம் தோறும் வரும் சந்திராஷ்டம தினத்தில் மட்டும் சிறிது எச்சரிக்கையாக இருக்கவும்.");

    }
    private void activity7() {
        rasi.setText("துலாம்");
        description.setText("இனிய ஆங்கில புத்தாண்டு வாழ்த்துக்களோடு இந்த 2024-ல் அடி எடுத்து வைக்கும் துலாம் ராசி அன்பர்களே, இவ்வாண்டு உங்களுக்கு நடைபெறவிருக்கும் பலன்களை பார்ப்போம். இந்த புதிய ஆண்டு 2024 மிகவும் நேர்மறையான குறிப்புடன் உங்களை வரவேற்கும். 7ஆம் வீட்டில் உள்ள குருவும், 12ஆம் வீட்டில் கேதுவும், 6ஆம் வீட்டில் ராகுவும் சஞ்சரிப்பதால் ராஜயோகம் உண்டாகும். எல்லா பிரச்சனைகளையும் ஒவ்வொன்றாக தீர்த்து வைக்க முடியும். குடும்ப உறவில் மகிழ்ச்சியாக இருக்கும். தொழில் மற்றும் பொருளாதார வளர்ச்சி சிறப்பாக இருக்கும். இந்த நேரத்தை நீங்கள் முக்கியமான முடிவுகளை எடுக்கவும், உங்கள் வாழ்க்கையில் நல்ல நிலையில் இருக்கவும் பயன்படுத்தலாம். சுப காரிய நிகழ்ச்சிகளை நடத்துவதில் மகிழ்ச்சி கிடைக்கும். குடும்பம் சமூகத்தில் நல்ல பெயரும் புகழும் பெறும். இந்த அதிர்ஷ்டங்களை நீங்கள் அனுபவிக்க முடியும் ஆனால் ஏப்ரல் 30, 2024 வரை மட்டுமே. ஏனெனில் மே 01, 2024 முதல் டிசம்பர் 31, 2024 வரையிலான நேரம் மற்றொரு சோதனைக் கட்டமாக இருக்கும். நீங்கள் உணர்ச்சி ரீதியாக பாதிக்க வாய்ப்புண்டு. மிகவும் நெருக்கமானவர்களால் நீங்கள் ஏமாற்றப்படலாம். துரோகம் மற்றும் சட்டப் போராட்டம் உங்கள் மன அமைதியைப் பாதிக்கலாம். உற்றார், உறவினர்களிடம் கவனமாக இருக்க வேண்டும், மேலும் பண விவகாரத்திலும் கவனமாக இருக்கவும். ஏற்கனவே திட்டமிடப்பட்ட சுப காரிய நிகழ்ச்சிகள் தடை பட வாய்ப்புண்டு. ஏப்ரல் 30, 2024க்கு முன் உங்கள் வாழ்க்கையை நன்றாக அமைக்க திட்டமிட வேண்டும். பிறகு கடினமான கட்டத்தை கடக்க உங்கள் எதிர்பார்ப்புகளை குறைக்க வேண்டும். துலாம் ராசியினருக்கு 2024 ஒரு அற்புதமான ஆண்டாக இருக்கும். இந்த ஆண்டு உங்கள் வாழ்க்கையில் பெரிய மாற்றங்கள் வரப்போகிறது. நிதி ரீதியாக நன்றாக இருக்கும். ஆனால், இதனுடன் சில தடைகளும் உங்கள் வழியில் வரலாம். தனிப்பட்ட வாழ்க்கையில் சில பிரச்சனைகள் இருக்கலாம். உணவு விஷயங்களில் கவனமாக இருக்கவும். நீங்கள் மிதமான வாழ்க்கை முறையை கடைப்பிடித்தால் அது உங்களுக்கு நல்லது. அதிக வேலைப்பளுவின் காரணமாக அதிக மன அழுத்தத்தை சந்திக்க வேண்டிவரும். நீங்கள் வழக்கு விவகாரங்களில் கவனமாக இருக்கவும். இந்த 2024 ஆண்டு உங்கள் வாழ்க்கையில் பல மாற்றங்களை கொன்று வர போகிறது. எல்லாவற்றிற்கும் இறை வழிபாடு ஒன்றே சிறந்த பரிகாரம்.\n" +
                "\n" +
                "பரிகாரம் : விநாயக பெருமானை மனதார வணங்கி வழிபடவும்\n" +
                "முக்கிய குறிப்பு : இந்த 2024ல் மாதம் தோறும் வரும் சந்திராஷ்டம தினத்தில் மட்டும் சிறிது எச்சரிக்கையாக இருக்கவும்.");

    }
    private void activity8() {
        rasi.setText("விருச்சி ");
        description.setText("இனிய ஆங்கில புத்தாண்டு 2024-ல் அடி எடுத்து வைக்கும் விருச்சிக ராசி அன்பர்களே, இவ்வாண்டு உங்களுக்கு நடைபெறவிருக்கும் பலன்களை பார்ப்போம். இந்த புதிய ஆண்டு 2024 இன் ஆரம்பம் பல வழிகளில் ஏமாற்றமளிக்கும். 5ஆம் வீட்டில் ராகு உங்கள் உறவுகளில் பிரச்சனைகளை உருவாக்குவார். குரு உங்கள் 6 ஆம் வீட்டில் மறைந்த எதிரிகள் மூலம் பிரச்சனைகளை உருவாக்குவார். இந்த 2024 ஆம் ஆண்டில் அர்த்தாஷ்டம சனியின் தீங்கான விளைவுகள் மோசமாகும். நல்ல செய்தி என்னவென்றால், உங்கள் 11 ஆம் வீட்டில் கேது உங்களுக்கு அர்த்தாஷ்டம சனிக்கு எதிராக பாதுகாப்பை வழங்குவார். ஜனவரி 01, 2024 முதல் ஏப்ரல் 30, 2024 வரை நீங்கள் பல தடைகளையும் ஏமாற்றங்களையும் சந்திக்க நேரிடும். அதிகரித்து வரும் வேலை அழுத்தம் மற்றும் பதற்றம் காரணமாக உங்கள் உடல்நலம் மோசமாகப் பாதிக்கப்படும். உங்கள் ஜாதகத்தில் தொழில் ஸ்தானம் பலவீனமாக இருந்தால், நீங்கள் உங்கள் வேலையை இழக்கலாம். எதிர்பாராத செலவுகளால் நிறைய பணத்தை இழக்க நேரிடும். ஆனால் மே 01, 2024 முதல் விஷயங்கள் சாதகமாக நடக்கத் தொடங்கும். உங்கள் 7ஆம் வீட்டில் உள்ள குரு 11ஆம் வீட்டில் கேதுவின் பார்வையைப் பெறுவதால் செய்யும் எதிலும் பெரிய வெற்றியைத் தரும். குரு பலத்தால் மன உளைச்சலில் இருந்து மீண்டு வர முடியும். இந்த காலகட்டத்தில் உங்கள் நிதி நிலைமை மேம்படும். பல சுப காரிய நிகழ்ச்சிகளை நடத்துவதில் மகிழ்ச்சி ஏற்படும். சமுதாயத்தில் நல்ல பெயரும் புகழும் கிடைக்கும். ஒட்டுமொத்தமாக, நீங்கள் ஏப்ரல் 30, 2024 வரை கடுமையான சோதனைக் கட்டத்தில் இருப்பீர்கள். பிறகு நீங்கள் நல்ல அதிர்ஷ்டத்தை அனுபவிக்க முடியும். ஆன்மிக எண்ணம் மேலோங்கும். உங்கள் அதிர்ஷ்டத்தை அதிகரிக்க முடியும். விருச்சிக ராசிக்காரர்களுக்கு 2024-ம் ஆண்டு முந்தைய ஆண்டை விட சிறப்பாக இருக்கும். இந்த ஆண்டு உங்களுக்கு புதிய வாய்ப்புகள் காத்திருக்கின்றன. செலவுகள் உங்களை தொடர்ந்து அழுத்தமாக வைத்திருக்கும் என்று கூறுகிறது. ஆண்டின் முதல் பாதி ஆரோக்கியத்தைப் பொறுத்தவரை நன்றாக இருக்கும். 2024 ஆம் ஆண்டில் வாகனம் ஓட்டும்போது கூடுதல் கவனமாக இருக்க வேண்டும். 2024, சொத்தில் முதலீடு செய்வது உங்களுக்கு சாதகமாக இருக்கும். இந்த 2024 ஆண்டு விருச்சிக ராசிகாரர்களுக்கு வெற்றி மீது வெற்றி வந்து சேரப்போகிறது.எல்லாவற்றிற்கும் இறை வழிபாடு ஒன்றே சிறந்த பரிகாரம்.\n" +
                "பரிகாரம் : வெள்ளிக்கிழமை தோறும் அம்பாள் கோவிலுக்குச் சென்று\n" +
                "முக்கிய குறிப்பு : இந்த 2024-ல் மாதம் தோறும் வரும் சந்திராஷ்டம தினத்தில் மட்டும் சிறிது எச்சரிக்கையாக இருக்கவும்.");

    }
    private void activity9() {
        rasi.setText("தனுசு");
        description.setText("இனிய ஆங்கில புத்தாண்டு 2024-ல் அடி எடுத்து வைக்கும் தனுசு ராசி அன்பர்களே, இவ்வாண்டு உங்களுக்கு நடைபெறவிருக்கும் பலன்களை பார்ப்போம். இந்தப் 2024 ஆண்டு, சச்சரவுகள் இல்லாத ஆண்டாக அமையப் போகிறது. இந்த வருடம் முக்கியமாக செய்ய வேண்டியது உங்கள் கோப தாபங்களை குறைத்துக்கொள்ளவும். 2024 இன் ஆரம்பம் உங்களுக்கு அற்புதமானதாக இருக்கும். உங்கள் 5 வது வீட்டில் குரு மற்றும் 3ஆம் வீட்டில் சனி உங்கள் வாழ்க்கையில் பெரிய அதிர்ஷ்டத்தை கொண்டு வரும். ராகு உங்கள் 4வது வீட்டிற்கும், கேது 10வது வீட்டிற்கும் சஞ்சரிப்பது கலவையான பலன்களையே தரும். ஆனால் ராகு மற்றும் கேதுவின் தோஷங்கள் உங்கள் 3ம் வீட்டில் இருக்கும் சனி பகவானின் பலத்தால் குறையும். எங்கும் எதிலும் வெற்றி காண முடியும். தொழில் மற்றும் நிதி வளர்ச்சியில் மகிழ்ச்சி இருக்கும். புதிய வீடு வாங்கி அதில் குடியேற முடியும். சுப காரிய செயல்பாடுகளை நடத்த இது ஒரு நல்ல நேரம். உங்கள் குடும்பம் சமூகத்தில் நல்ல பெயரும் புகழும் பெறும். ஏப்ரல் 30, 2024 வரை இந்த அதிர்ஷ்டங்களை நீங்கள் அனுபவிக்க முடியும். ஆனால் மே 01, 2024 முதல் டிசம்பர் 31, 2024 வரையிலான காலம் உங்களுக்கு கலவையான பலன்களைத் தரும். சனி நல்ல அதிர்ஷ்டத்தை வழங்கும் போது உங்கள் 6ஆம் வீட்டில் குருவின் தாக்கம் உணரப்படும். நீண்ட கால நோக்கங்களில் வெற்றி காண முடியும். ஆனால் குறுகிய கால திட்டங்கள் சரியாக அமையாது. இந்த கட்டத்தில் உங்கள் உடல் நலம் பாதிக்கப்படலாம். உத்யோக பணி சராசரியாக இருக்கும். தொழில் மற்றும் நிதியில் சராசரி வளர்ச்சி கிடைக்கும். ஜன. 01, 2024 முதல் மே 01, 2024 வரையிலான பொற்காலத்தை எப்படிப் பயன்படுத்திக் கொண்டு, உங்கள் வாழ்க்கையில் நன்றாக நிலை பெறுவது என்பதை நீங்கள் தெரிந்து கொள்ள வேண்டும். தனுசு ராசிக்காரர்களுக்கு இந்த வருடம் மிகவும் சிறப்பாக இருக்கும். பொருளாதாரக் கண்ணோட்டத்தைப் பற்றி பேசினால், முதல் பாதி உங்களுக்கு சாதகமாக இருக்கும். செல்வம் மற்றும் அறிவு திறன் அதிகரிப்பதற்கான அறிகுறிகளும் தெளிவாகத் தெரியும். வீட்டுக் கவலைகளும் உங்களைத் தொந்தரவு செய்யலாம். இந்த 2024 ஆண்டு தனுசு ராசிகாரர்களுக்கு எதையும் சமாளிக்கும் தெம்பும் தைரியமும் பிறக்கும்.எல்லாவற்றிற்கும் இறை வழிபாடு ஒன்றே சிறந்த பரிகாரம்.\n" +
                "பரிகாரம் : குரு பகவானை தீபம் ஏற்றி வழிபடவும்\n" +
                "முக்கிய குறிப்பு : இந்த 2024ல் மாதம் தோறும் வரும் சந்திராஷ்டம தினத்தில் மட்டும் சிறிது எச்சரிக்கையாக இருக்கவும்.");

    }
    private void activity10() {
        rasi.setText("மகரம்");
        description.setText("இனிய ஆங்கில புத்தாண்டு 2024-ல் அடி எடுத்து வைக்கும் மகர ராசி அன்பர்களே, இவ்வாண்டு உங்களுக்கு நடைபெறவிருக்கும் பலன்களை பார்ப்போம். இந்த புத்தாண்டு நேர்மறையான குறிப்புடன் தொடங்கும். சனி 2ம் வீட்டில் இருந்து செலவுகளை அதிகரிக்கும். ஆனால் உங்கள் 3ஆம் வீட்டில் ராகு சனியின் தீங்கு விளைவிக்கும் விளைவுகளிலிருந்து உங்களைப் பாதுகாப்பார். 9 ஆம் வீட்டில் கேது சஞ்சரிப்பது குடும்ப பிரச்சனைகளை உருவாக்கி உங்கள் அதிர்ஷ்டத்தை ஓரளவு பாதிக்கும். ஜனவரி 01, 2024 முதல் ஏப்ரல் 30, 2024 வரை உங்களின் 4வது வீட்டில் இருக்கும் வியாழன் சற்று நிம்மதியைத் தருவார். குடும்பப் பிரச்சனைகளை ஒவ்வொன்றாக தீர்க்க முடியும். பணியிடத்தில் உங்கள் செயல்பாடுகள் சிறப்பாக இருக்கும். உங்கள் நிதிநிலை சிறப்பாக அமையும். ஆனால் கடனை அடைக்க முடியாது. நல்ல செய்தி என்னவென்றால், மே 01, 2024 முதல் நீங்கள் ஒரு பெரிய அதிர்ஷ்டக் கட்டத்தை அனுபவிக்க முடியும். 7 ஆண்டுகளுக்குப் பிறகு குரு உங்கள் ஜென்ம ராசியைப் பார்க்கிறார். சனியால் ஏதேனும் தீய விளைவுகள் ஏற்படும். ராகு உங்கள் அதிர்ஷ்டத்தால் பல மடங்கு பெருகும். நீங்கள் செய்யும் எதுவும் ஆகட்டும்; அது பெரும் வெற்றியாக மாறும். உங்கள் ஆரோக்கியம், உறவுகள், தொழில் மற்றும் நிதி வளர்ச்சி ஆகியவற்றில் மகிழ்ச்சி இருக்கும். உங்கள் குடும்பம் சமூகத்தில் நல்ல பெயரும் புகழும் பெறும். ஒட்டுமொத்தமாக, ஏப்ரல் 30, 2024 வரை நீங்கள் கொஞ்சம் கவனமாக இருந்தால், இந்த ஆண்டு முழுவதும் நீங்கள் நல்ல அதிர்ஷ்டத்தை அனுபவிக்க முடியும். எதிரிகளிடமிருந்து பாதுகாப்பு பெற நரசிம்ம கவசம் படிக்கவும். மகர ராசிக்காரர்களுக்கு இந்த வருடம் வேலை விஷயத்தில் மிகவும் சிறப்பாக இருக்கும். பெண்களுக்கு உடல்நலப் பிரச்சினைகள் இருக்கலாம். உங்கள் செலவுகளுக்கும் வருமானத்திற்கும் இடையில் சரியான சமநிலை இருக்கும். உங்கள் சமூக வட்டம் அதிகரிக்கும். ஆண்டின் முதல் பாதியில் உற்சாகம் அதிகரிக்கும். 2024 ஆம் ஆண்டின் கணிப்புப்படி, பல வழிகளில் இருந்து பணம் கிடைக்கும். புது முதலீடுகளை தாராளமாக மேற்கொள்ளலாம். தொழில் ரீதியாக சில முக்கிய முடிவுகளை எடுக்க வேண்டியிருக்கும். இந்த ஆண்டு லாபமும் வெற்றியும் நிச்சயம் உங்கள் கதவைத் தட்டும். இருப்பினும் செலவுகள் அதிகரிக்கும். இந்த 2024 மகர ராசிக்காரர்களுக்கு பாத சனி என்றாலும் பதற்றப்பட வேண்டாம்.எல்லாவற்றிற்கும் இறை வழிபாடு ஒன்றே சிறந்த பரிகாரம்.\n" +
                "பரிகாரம் : சனிக்கிழமைகளில் அனுமான் கோவிலை வலம் வரவும்\n" +
                "முக்கிய குறிப்பு : இந்த 2024-ல் மாதம் தோறும் வரும் சந்திராஷ்டம தினத்தில் மட்டும் சிறிது எச்சரிக்கையாக இருக்கவும்.");

    }
    private void activity11() {
        rasi.setText("கும்பம்");
        description.setText("இனிய ஆங்கில புத்தாண்டு 2024-ல் அடி எடுத்து வைக்கும் கும்ப ராசி அன்பர்களே, இவ்வாண்டு உங்களுக்கு நடைபெறவிருக்கும் பலன்களை பார்ப்போம். இந்த 2024 புத்தாண்டு பொறுத்தவரை ஒரு சில பிரச்சனைகளை சந்திக்க வேண்டிவரும். 2024-ல் பொருளாதார நெருக்கடிகளை சாமர்த்தியமாக சமாளிக்க முடியும். ராசிக்கு 2வது வீட்டிற்கு ராகு பெயர்ச்சி உங்கள் நிதி நிலைமையை பாதிக்கும். 8ஆம் வீட்டில் இருக்கும் கேது உங்களுக்கு நல்ல பலன்களைத் தருவார். துரதிர்ஷ்டவசமாக ஜென்ம ராசியில் உள்ள சனி ஏமாற்றங்களையும் தோல்விகளையும் உருவாக்குவார். நீங்கள் செய்யும் எதிலும் தாமதம் மற்றும் தகவல் தொடர்பு பிரச்சனைகளை சந்திக்க வேண்டிவரும். முக்கிய விஷயங்களை மோசமாக்க, குரு உங்கள் 3 ஆம் வீட்டில் ஜன. 01, 2024 முதல் மே 01, 2024 வரை இருக்கும் பிரச்சனைகளை மோசமாக்குவார். ஜென்ம சனியின் காரணமாக உங்களுக்கு மன அழுத்தம் மற்றும் பதற்றம் அதிகம். ஆரோக்கியத்திற்கு அதிக முக்கியத்துவம் கொடுக்க வேண்டும். உங்கள் பணியிடத்தில் விஷயங்கள் சரியாக நடக்காமல் போகலாம். உங்கள் நிதி நிலைமை மிகவும் மோசமாகிவிடும். குடும்பச் சூழலில் பிரச்சனைகள் ஏற்படும். தொலைதூரப் பயணம் உங்களுக்கு மோசமான பலன்களைத் தரும். மே 01, 2024 மற்றும் டிசம்பர் 31, 2024க்குப் பிறகு விஷயங்கள் கொஞ்சம் சிறப்பாக இருக்கும். உங்களுக்கு நல்ல அதிர்ஷ்டம் இருக்கும் என்று நான் சொல்லவில்லை. இதுவும் ஒரு சோதனைக் கட்டம்தான், ஆனால் 4வது வீட்டில் குரு பலமாக இருப்பதால் பிரச்சனைகளின் தீவிரம் குறைவாக இருக்கும். தவிர்க்க முடியாத ஜென்ம சனியால் ஏற்படும் குறிப்பிடத்தக்க மன அழுத்தம் மற்றும் பதற்றத்தை நீங்கள் சமாளிக்க வேண்டியிருக்கும். இந்த சோதனைக் கட்டத்தை கடக்க ஆன்மீக பலத்தை அதிகரிக்க நீங்கள் பிரார்த்தனை செய்யவும். கிரகங்களின் தாக்கத்தால் கும்ப ராசிக்காரர்களுக்கு இந்த வருடம் மிகவும் சாதகமாக இருக்கும். ஆண்டின் முற்பாதியில் நீங்கள் பயணம் செய்ய வேண்டியிருக்கும். இந்த நேரத்தில் உங்கள் வருமானம் கூடும். 2024 உங்கள் தனிப்பட்ட வாழ்க்கையில் சில பிரச்சனைகள் இருக்கலாம். உங்கள் விருப்பங்களை அதிக ஆற்றலுடனும் தெளிவுடனும் வெளிப்படுத்த முடியும். 2024 உங்கள் விருப்பங்களை நிறைவேற்ற இந்த ஆண்டு சரியான நேரம். முன்னேற்றம், வெற்றி மற்றும் செழிப்பு உங்களுக்கு காத்திருக்கிறது.\n" +
                "2024ஆம் ஆண்டு முழுக்க கும்ப ராசிகாரர்களுக்கு ஜென்ம சனி காலம் என்றாலும் பெரிதாக பாதிப்பு எதுவும் ஏற்படப்போவதில்லை. எல்லாவற்றிற்கும் இறை வழிபாடு ஒன்றே சிறந்த பரிகாரம்.\n" +
                "பரிகாரம் : சனிக்கிழமைகளில் சிவன் கோவிலை வலம் வரவும்\n" +
                "முக்கிய குறிப்பு : இந்த 2024ல் மாதம் தோறும் வரும் சந்திராஷ்டம தினத்தில் மட்டும் சிறிது எச்சரிக்கையாக இருக்கவும்.");

    }
    private void activity12() {
        rasi.setText("மீனம்");
        description.setText("இனிய ஆங்கில புத்தாண்டு 2024-ல் அடி எடுத்து வைக்கும் மீன ராசி அன்பர்களே, இவ்வாண்டு உங்களுக்கு நடைபெறவிருக்கும் சில பலன்களை பார்ப்போம். 2024 தொடக்கம் முதற்கொண்டு சனி பகவான் விரையச் சனியாக சஞ்சரிக்க இருப்பதால் நல்ல பலன்கள் குறைவாகவே கிடைக்கும். இந்த புத்தாண்டு 2024 இல் கலவையான பலன்களை அனுபவிக்க முடியும். மேலும் ஆண்டு முழுவதும் வரவை விட செலவு அதிகமாகும். உங்கள் ஜென்ம ஸ்தானத்தில் ராகுவின் சஞ்சாரம் உடல் உபாதைகளை உருவாக்கும். 7 ஆம் வீட்டில் கேது வாழ்க்கைத்துணை மற்றும் முக்கிய உறவுகளிடம் சிக்கல்களை உருவாக்குவார். 12வது வீட்டில் இருக்கும் சனி உங்கள் வளர்ச்சியை நீண்ட கால அடிப்படையில் பாதிக்கும். குரு உங்கள் 2வது வீட்டில் சஞ்சரிப்பது உங்கள் 12வது வீட்டில் சனியின் தீய விளைவுகளைத் தணித்து, ஜனவரி 01, 2024 மற்றும் ஏப்ரல் 30, 2024க்குள் நல்ல பலன்களைத் தரும். பிரச்சனைகளை ஒவ்வொன்றாக தீர்த்து வைப்பதில் உங்களுக்கு நல்ல நேரம் கிடைக்கும். உங்கள் முயற்சிகளில் மகத்தான வெற்றி கிட்டும். புதிய வேலையில் மகிழ்ச்சி கிட்டும். உங்கள் நிதி பிரச்சனைகளில் இருந்து விடுபட முடியும். புதிய வீடு வாங்குவதற்கும், வீடு மாறுவதற்கும் நல்ல நேரம். உங்கள் குடும்பம் சமூகத்தில் நல்ல பெயரும் புகழும் பெறும். மே 01, 2024 முதல் டிசம்பர் 31, 2024 வரையிலான நேரம் சோதனைக் கட்டமாக இருக்கும். சற்று சனி பகவானின் தாக்கம் அதிகமாக இருக்கும். உங்கள் மனைவி மற்றும் பெற்றோரின் ஆரோக்கியத்தில் கவனம் தேவை. தூக்கம் ரீதியாக சில தொந்தரவுகள் இருக்கும். உங்கள் பணியிடத்தில் எந்த வளர்ச்சியையும் எதிர்பார்க்க முடியாது. அதிகரித்து வரும் செலவுகளால் அதிக பணத்தை சேமிக்க முடியாது. உங்கள் நிதி நிலைமை பாதிக்கப்படும். ஜனவரி 01, 2024 முதல் ஏப்ரல் 30, 2024 வரை நீங்கள் நன்றாகச் செயல்பட முடியும். அதைத் தொடர்ந்து கடுமையான சோதனைக் கட்டம். தெய்வ பிராத்தனை செய்து வர நிதியில் அதிர்ஷ்டம் பெருகும். 2024 ஆம் ஆண்டு சாதகமாக இல்லை. உங்கள் உடல்நிலையில் கவனமாக இருக்க வேண்டும். ஆன்மீகத்தில் ஈடுபாடு உண்டாகும். சமூகமும் அரசாங்கமும் உங்களுக்கு சிரமங்களை உருவாக்கலாம். ஆண்டின் இரண்டாம் பாதியில் உங்களுக்கு பல சங்கடங்கள் இருக்கலாம். உங்கள் தொழில் மற்றும் வேலையில் மாற்றங்கள் எதிர்பார்க்கப்படுகின்றன. இந்த 2024 ஆண்டு மீன ராசிகாரர்களுக்கு பல புதுமைகளை தரக்கூடிய ஆண்டாக அமையப்போகிறது.எல்லாவற்றிற்கும் இறை வழிபாடு ஒன்றே சிறந்த பரிகாரம்.\n" +
                "பரிகாரம் : வியாழன்தோறும் நவக்கிரக கோவிலுக்கு சென்று நெய் தீபம் ஏற்றி அர்ச்சனை செய்யவும்\n" +
                "முக்கிய குறிப்பு : இந்த 2024ல் மாதம் தோறும் வரும் சந்திராஷ்டம தினத்தில் மட்டும் சிறிது எச்சரிக்கையாக இருக்கவும்.");

    }



}